---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FormattedText..::..SetUnderlineStatus Method
FormattedText Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetUnderlineStatus(Boolean) | Sets the characters in the entire text to be underlined or not underlined. |
|  | SetUnderlineStatus(TextRange, Boolean) | Sets the characters in a given text range to be underlined or not underlined. |

# See Also

FormattedText Class

FormattedText Members

Autodesk.Revit.DB Namespace